Revit 2016 API
NurbSpline.Create Method
Overload List
Name | Description
Create(IList<XYZ>, IList<Double>)
 Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Create(IList<XYZ>, IList<Double>, IList<Double>, Int32, Boolean, Boolean)
 Creates a new geometric NURBSpline object.
See Also
NurbSpline Class
NurbSpline Members
Autodesk.Revit.DB Namespace